# practice dataset
# ------------------------------------------------------------------

# using read_excel() load the student dataset

In [53]:
import pandas as pd
df = pd.read_excel('student.xlsx')
df.columns

Index(['Unnamed: 0', 'id', 'gen', 'age', 'location', 'score', 'state'], dtype='object')

# using df.columns understand the dataset features(columns)

In [54]:
df.columns

Index(['Unnamed: 0', 'id', 'gen', 'age', 'location', 'score', 'state'], dtype='object')

# using df.info() understand the column information

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  24 non-null     int64
 1   id          24 non-null     int64
 2   gen         22 non-null     object
 3   age         20 non-null     float64
 4   location    12 non-null     object
 5   score       24 non-null     int64
 6   state       12 non-null     object
dtypes: float64(1), int64(3), object(3)
memory usage: 1.4+ KB

# using head() get top 6 students and understand the data

In [56]:
df.head(6)

   Unnamed: 0   id     gen   age   location  score          state
0           0  101  female  22.0  hyderabad     55  andra pradesh
1           1  102  female  23.0        NaN     77            NaN
2           2  101  female  22.0  hyderabad     55  andra pradesh
3           3  104  female  21.0        NaN     99            NaN
4           4  105    MALE  23.0  Bengaluru     13      karnataka
5           5  106  female  21.0        NaN     32            NaN

In [57]:
df=df.drop(columns=['Unnamed: 0'])

# check for duplicates using duplicated()

In [58]:
df.duplicated().any()

True

# remove the duplicates using drop_duplicates()

In [59]:
df=df.drop_duplicates('id')
df

     id     gen   age   location  score          state
0   101  female  22.0  hyderabad     55  andra pradesh
1   102  female  23.0        NaN     77            NaN
3   104  female  21.0        NaN     99            NaN
4   105    MALE  23.0  Bengaluru     13      karnataka
5   106  female  21.0        NaN     32            NaN
6   107    MALE  23.0        NaN     13            NaN
7   108  female  23.0        NaN     13            NaN
8   109     NaN  22.0        NaN     92            NaN
9   110    MALE  23.0        NaN     10            NaN
10  111  female   NaN      kochi     13         kerala
11  112  female  21.0     mumbai     13    maharashtra
12  113  female  21.0        NaN     65            NaN
13  114     NaN  21.0  Bengaluru     13      karnataka
14  115    MALE  23.0        NaN     92            NaN
15  116    MALE   NaN        NaN     77            NaN
16  117    MALE  23.0  hyderabad     55  andra pradesh
17  118  female  22.0    chennai     36     tamil nadu
18  119  female   NaN      kochi     46         kerala
19  120  female  23.0      kochi     46         kerala
20  103  female   NaN     mumbai     13    maharashtra

In [60]:
df.duplicated().any()

False

# check the information of columns usin info()

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, 0 to 20
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        20 non-null     int64
 1   gen       18 non-null     object
 2   age       16 non-null     float64
 3   location  10 non-null     object
 4   score     20 non-null     int64
 5   state     10 non-null     object
dtypes: float64(1), int64(2), object(3)
memory usage: 1.1+ KB

# display the df

In [62]:
df

     id     gen   age   location  score          state
0   101  female  22.0  hyderabad     55  andra pradesh
1   102  female  23.0        NaN     77            NaN
3   104  female  21.0        NaN     99            NaN
4   105    MALE  23.0  Bengaluru     13      karnataka
5   106  female  21.0        NaN     32            NaN
6   107    MALE  23.0        NaN     13            NaN
7   108  female  23.0        NaN     13            NaN
8   109     NaN  22.0        NaN     92            NaN
9   110    MALE  23.0        NaN     10            NaN
10  111  female   NaN      kochi     13         kerala
11  112  female  21.0     mumbai     13    maharashtra
12  113  female  21.0        NaN     65            NaN
13  114     NaN  21.0  Bengaluru     13      karnataka
14  115    MALE  23.0        NaN     92            NaN
15  116    MALE   NaN        NaN     77            NaN
16  117    MALE  23.0  hyderabad     55  andra pradesh
17  118  female  22.0    chennai     36     tamil nadu
18  119  female   NaN      kochi     46         kerala
19  120  female  23.0      kochi     46         kerala
20  103  female   NaN     mumbai     13    maharashtra

# sort the data according to student id (asc order using sort_values())

In [63]:
df=df.sort_values('id').reset_index(drop=True)
df

     id     gen   age   location  score          state
0   101  female  22.0  hyderabad     55  andra pradesh
1   102  female  23.0        NaN     77            NaN
2   103  female   NaN     mumbai     13    maharashtra
3   104  female  21.0        NaN     99            NaN
4   105    MALE  23.0  Bengaluru     13      karnataka
5   106  female  21.0        NaN     32            NaN
6   107    MALE  23.0        NaN     13            NaN
7   108  female  23.0        NaN     13            NaN
8   109     NaN  22.0        NaN     92            NaN
9   110    MALE  23.0        NaN     10            NaN
10  111  female   NaN      kochi     13         kerala
11  112  female  21.0     mumbai     13    maharashtra
12  113  female  21.0        NaN     65            NaN
13  114     NaN  21.0  Bengaluru     13      karnataka
14  115    MALE  23.0        NaN     92            NaN
15  116    MALE   NaN        NaN     77            NaN
16  117    MALE  23.0  hyderabad     55  andra pradesh
17  118  female  22.0    chennai     36     tamil nadu
18  119  female   NaN      kochi     46         kerala
19  120  female  23.0      kochi     46         kerala

# reset the index using reset_index()

# change the gen col_name to gender using rename()

In [64]:
df=df.rename(columns={'gen':'gender'})
df

     id  gender   age   location  score          state
0   101  female  22.0  hyderabad     55  andra pradesh
1   102  female  23.0        NaN     77            NaN
2   103  female   NaN     mumbai     13    maharashtra
3   104  female  21.0        NaN     99            NaN
4   105    MALE  23.0  Bengaluru     13      karnataka
5   106  female  21.0        NaN     32            NaN
6   107    MALE  23.0        NaN     13            NaN
7   108  female  23.0        NaN     13            NaN
8   109     NaN  22.0        NaN     92            NaN
9   110    MALE  23.0        NaN     10            NaN
10  111  female   NaN      kochi     13         kerala
11  112  female  21.0     mumbai     13    maharashtra
12  113  female  21.0        NaN     65            NaN
13  114     NaN  21.0  Bengaluru     13      karnataka
14  115    MALE  23.0        NaN     92            NaN
15  116    MALE   NaN        NaN     77            NaN
16  117    MALE  23.0  hyderabad     55  andra pradesh
17  118  female  22.0    chennai     36     tamil nadu
18  119  female   NaN      kochi     46         kerala
19  120  female  23.0      kochi     46         kerala

# get unique values of gender column using unique()

In [65]:
df['gender'].unique()

array(['female', 'MALE', nan], dtype=object)

# convert gender values to title case and repalce the incomplete values using (str.title() and replace() )

In [66]:
df['gender']=df['gender'].str.title()
df

     id  gender   age   location  score          state
0   101  Female  22.0  hyderabad     55  andra pradesh
1   102  Female  23.0        NaN     77            NaN
2   103  Female   NaN     mumbai     13    maharashtra
3   104  Female  21.0        NaN     99            NaN
4   105    Male  23.0  Bengaluru     13      karnataka
5   106  Female  21.0        NaN     32            NaN
6   107    Male  23.0        NaN     13            NaN
7   108  Female  23.0        NaN     13            NaN
8   109     NaN  22.0        NaN     92            NaN
9   110    Male  23.0        NaN     10            NaN
10  111  Female   NaN      kochi     13         kerala
11  112  Female  21.0     mumbai     13    maharashtra
12  113  Female  21.0        NaN     65            NaN
13  114     NaN  21.0  Bengaluru     13      karnataka
14  115    Male  23.0        NaN     92            NaN
15  116    Male   NaN        NaN     77            NaN
16  117    Male  23.0  hyderabad     55  andra pradesh
17  118  Female  22.0    chennai     36     tamil nadu
18  119  Female   NaN      kochi     46         kerala
19  120  Female  23.0      kochi     46         kerala

In [67]:
age_mean=df['age'].mean()
age_mean

22.1875

# handle the null values of age and gender using fillna()

In [71]:
df['age']=df['age'].fillna(age_mean)
df

     id  gender      age   location  score          state
0   101  Female  22.0000  hyderabad     55  andra pradesh
1   102  Female  23.0000        NaN     77            NaN
2   103  Female  22.1875     mumbai     13    maharashtra
3   104  Female  21.0000        NaN     99            NaN
4   105    Male  23.0000  Bengaluru     13      karnataka
5   106  Female  21.0000        NaN     32            NaN
6   107    Male  23.0000        NaN     13            NaN
7   108  Female  23.0000        NaN     13            NaN
8   109     NaN  22.0000        NaN     92            NaN
9   110    Male  23.0000        NaN     10            NaN
10  111  Female  22.1875      kochi     13         kerala
11  112  Female  21.0000     mumbai     13    maharashtra
12  113  Female  21.0000        NaN     65            NaN
13  114     NaN  21.0000  Bengaluru     13      karnataka
14  115    Male  23.0000        NaN     92            NaN
15  116    Male  22.1875        NaN     77            NaN
16  117    Male  23.0000  hyderabad     55  andra pradesh
17  118  Female  22.0000    chennai     36     tamil nadu
18  119  Female  22.1875      kochi     46         kerala
19  120  Female  23.0000      kochi     46         kerala

In [75]:
gender_mode=df['gender'].mode()[0]
gender_mode

'Female'

In [77]:
df['gender']=df['gender'].fillna(gender_mode)
df

     id  gender      age   location  score          state
0   101  Female  22.0000  hyderabad     55  andra pradesh
1   102  Female  23.0000        NaN     77            NaN
2   103  Female  22.1875     mumbai     13    maharashtra
3   104  Female  21.0000        NaN     99            NaN
4   105    Male  23.0000  Bengaluru     13      karnataka
5   106  Female  21.0000        NaN     32            NaN
6   107    Male  23.0000        NaN     13            NaN
7   108  Female  23.0000        NaN     13            NaN
8   109  Female  22.0000        NaN     92            NaN
9   110    Male  23.0000        NaN     10            NaN
10  111  Female  22.1875      kochi     13         kerala
11  112  Female  21.0000     mumbai     13    maharashtra
12  113  Female  21.0000        NaN     65            NaN
13  114  Female  21.0000  Bengaluru     13      karnataka
14  115    Male  23.0000        NaN     92            NaN
15  116    Male  22.1875        NaN     77            NaN
16  117    Male  23.0000  hyderabad     55  andra pradesh
17  118  Female  22.0000    chennai     36     tamil nadu
18  119  Female  22.1875      kochi     46         kerala
19  120  Female  23.0000      kochi     46         kerala

# convert age column to intype usin astype()

In [80]:
df=df.astype({'age':'int'})
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        20 non-null     int64
 1   gender    20 non-null     object
 2   age       20 non-null     int32
 3   location  10 non-null     object
 4   score     20 non-null     int64
 5   state     10 non-null     object
dtypes: int32(1), int64(2), object(3)
memory usage: 1012.0+ bytes

# remove the column location,state bcz it has more null values (use dropna() )

In [84]:
df=df.dropna()
df=df.reset_index(drop=True)
df

    id  gender  age   location  score          state
0  101  Female   22  hyderabad     55  andra pradesh
1  103  Female   22     mumbai     13    maharashtra
2  105    Male   23  Bengaluru     13      karnataka
3  111  Female   22      kochi     13         kerala
4  112  Female   21     mumbai     13    maharashtra
5  114  Female   21  Bengaluru     13      karnataka
6  117    Male   23  hyderabad     55  andra pradesh
7  118  Female   22    chennai     36     tamil nadu
8  119  Female   22      kochi     46         kerala
9  120  Female   23      kochi     46         kerala

# create the Result Classifications(grade) using score
(fail,first class,second class and distinction)

In [85]:
df.agg({'score':['min','max']})

     score
min     13
max     55

In [88]:
df['grade']=pd.cut(df['score'],bins=[0,13,36,46,55],
                   labels=['fail','first_class','second_class','distinction'],include_lowest=False)
df

    id  gender  age   location  score          state         grade
0  101  Female   22  hyderabad     55  andra pradesh   distinction
1  103  Female   22     mumbai     13    maharashtra          fail
2  105    Male   23  Bengaluru     13      karnataka          fail
3  111  Female   22      kochi     13         kerala          fail
4  112  Female   21     mumbai     13    maharashtra          fail
5  114  Female   21  Bengaluru     13      karnataka          fail
6  117    Male   23  hyderabad     55  andra pradesh   distinction
7  118  Female   22    chennai     36     tamil nadu   first_class
8  119  Female   22      kochi     46         kerala  second_class
9  120  Female   23      kochi     46         kerala  second_class

# get the no_of_students (using shape attribute)

In [90]:
df.shape

(10, 7)

# get the gender wise no_of_studs (using value_counts() )

In [91]:
df.value_counts(df['gender'])

gender
Female    8
Male      2
Name: count, dtype: int64

# find the average age

In [92]:
df.agg({'age':'average'})

age    22.1
dtype: float64

# find the male average age

In [110]:
df.loc[df['gender']=='Male'].agg({'age':'mean'})

age    23.0
dtype: float64

# get the highest and lowest score

In [102]:
df.agg({'score':['max','min']})

     score
max     55
min     13

# get the gender wise highest  , lowest and average score

In [109]:
df.groupby(df['gender']).agg({'score':['max','min','mean']})

       score
         max min    mean
gender
Female    55  13  29.375
Male      55  13  34.000